# vim:ft=ruby

tap "homebrew/bundle"

# packages
brew "bat" # better cat
brew "eza" # ls alternative
brew "fastfetch" # pretty system info
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "ghq" # Manage remote repository clones
brew "git" # Git version control (latest version)
brew "git-delta" # a better git diff
brew "grep" # grep (latest)
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "neovim" # A better vim
brew "ripgrep" # very fast file searcher
brew "sheldon" # Fast, configurable, shell plugin manager
brew "shfmt" # shell formatter
brew "starship" # The minimal, blazing-fast, and infinitely customizable prompt
brew "tree" # pretty-print directory contents
brew "wget" # internet file retriever
brew "zsh" # zsh (latest)
