# vim:ft=ruby

if OS.linux?
    brew "xclip" # access to clipboard (similar to pbcopy/pbpaste)
end

tap "homebrew/bundle"

# packages
brew "bat" # better cat
brew "eza" # ls alternative
brew "fd" # find alternative
brew "fzf" # Fuzzy file searcher, used in scripts and in vim
brew "git" # Git version control (latest version)
brew "git-delta" # a better git diff
brew "grep" # grep (latest)
brew "htop" # a top alternative
brew "jq" # work with JSON files in shell scripts
brew "neofetch" # pretty system info
brew "neovim" # A better vim
brew "ripgrep" # very fast file searcher
brew "starship" # The minimal, blazing-fast, and infinitely customizable prompt
brew "tree" # pretty-print directory contents
brew "vim" # Vim (latest)
brew "wget" # internet file retriever
brew "zsh" # zsh (latest)
